In [1]:
import sys
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

plt.style.use('seaborn')

In [2]:
df_employee = pd.read_csv('./datasets/employee.csv')

In [3]:
df_employee.head()

   no  nama tanggal_lahir jenis_kelamin      gaji
0   1   ani      3/2/1993     perempuan   1000000
1   2  budi      3/1/1992     laki-laki   2000000
2   3  susi      4/5/2000     perempuan   1350000
3   4  wati     5/20/1995     perempuan  10000000
4   5   ati     4/23/1994     perempuan   3400000

In [4]:
df_employee.dtypes

no                int64
nama             object
tanggal_lahir    object
jenis_kelamin    object
gaji              int64
dtype: object

In [5]:
df_employee.isnull().any()

no               False
nama             False
tanggal_lahir    False
jenis_kelamin    False
gaji             False
dtype: bool

In [6]:
df_employee['tanggal_lahir']

0     3/2/1993
1     3/1/1992
2     4/5/2000
3    5/20/1995
4    4/23/1994
5     5/6/1991
6     4/5/1990
7     4/3/1998
8    6/20/1993
9    9/20/2001
Name: tanggal_lahir, dtype: object

In [7]:
df_employee['tanggal_lahir'] = pd.to_datetime(df_employee['tanggal_lahir'])
df_employee

   no  nama tanggal_lahir jenis_kelamin      gaji
0   1   ani    1993-03-02     perempuan   1000000
1   2  budi    1992-03-01     laki-laki   2000000
2   3  susi    2000-04-05     perempuan   1350000
3   4  wati    1995-05-20     perempuan  10000000
4   5   ati    1994-04-23     perempuan   3400000
5   6   ina    1991-05-06     perempuan   5000000
6   7   nia    1990-04-05     perempuan   2500000
7   8  dodi    1998-04-03     laki-laki   3400000
8   9  dedi    1993-06-20     laki-laki   8900000
9  10  roni    2001-09-20     laki-laki   2100000

In [8]:
jk_dummies = pd.get_dummies(df_employee['jenis_kelamin'], prefix='jk')
jk_dummies.head()

   jk_laki-laki  jk_perempuan
0             0             1
1             1             0
2             0             1
3             0             1
4             0             1

In [9]:
df_employee_jk = pd.concat([df_employee,jk_dummies], axis=1)

In [10]:
df_employee_jk

   no  nama tanggal_lahir jenis_kelamin      gaji  jk_laki-laki  jk_perempuan
0   1   ani    1993-03-02     perempuan   1000000             0             1
1   2  budi    1992-03-01     laki-laki   2000000             1             0
2   3  susi    2000-04-05     perempuan   1350000             0             1
3   4  wati    1995-05-20     perempuan  10000000             0             1
4   5   ati    1994-04-23     perempuan   3400000             0             1
5   6   ina    1991-05-06     perempuan   5000000             0             1
6   7   nia    1990-04-05     perempuan   2500000             0             1
7   8  dodi    1998-04-03     laki-laki   3400000             1             0
8   9  dedi    1993-06-20     laki-laki   8900000             1             0
9  10  roni    2001-09-20     laki-laki   2100000             1             0

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
le = LabelEncoder()

In [17]:
df_employee_jk['jk_label']= le.fit_transform(df_employee['jenis_kelamin'])

In [18]:
df_employee_jk

,no,nama,tanggal_lahir,jenis_kelamin,gaji,jk_laki-laki,jk_perempuan,jk_label
0,1,ani,1993-03-02,perempuan,1000000,0,1,1
1,2,budi,1992-03-01,laki-laki,2000000,1,0,0
2,3,susi,2000-04-05,perempuan,1350000,0,1,1
3,4,wati,1995-05-20,perempuan,10000000,0,1,1
4,5,ati,1994-04-23,perempuan,3400000,0,1,1
5,6,ina,1991-05-06,perempuan,5000000,0,1,1
6,7,nia,1990-04-05,perempuan,2500000,0,1,1
7,8,dodi,1998-04-03,laki-laki,3400000,1,0,0
8,9,dedi,1993-06-20,laki-laki,8900000,1,0,0
9,10,roni,2001-09-20,laki-laki,2100000,1,0,0

In [19]:
#del df_employee_jk

In [20]:
from sklearn.preprocessing import StandardScaler

In [21]:
sc = StandardScaler()

In [27]:
df_employee_jk['sc_gaji'] = sc.fit_transform(df_employee[['gaji']])

NameError: name 'df_employee_jk' is not defined

In [26]:
df_employee_jk

NameError: name 'df_employee_jk' is not defined

In [28]:
sns.displot(df_employee_jk[])

NameError: name 'df_employee_jk' is not defined

In [30]:
from sklearn.preprocessing import MinMaxScaler

In [32]:
mx = MinMaxScaler()

In [33]:
df_employee_jk =

SyntaxError: invalid syntax (<ipython-input-33-5d65ffa7e09b>, line 1)

In [ ]:
sns.displot(df_employee_jk)